In [28]:
import pandas as pd

athletes = pd.read_csv('data/athlete_events.csv')
# Count how many unique occurences of countries and sports are there
print(f"# of countires: {len(athletes['NOC'].unique())}")
print(f"# of sports: {len(athletes['Sport'].unique())}")
print(f"# of events: {len(athletes['Event'].unique())}")
print(f"# of athletes: {len(athletes['Name'].unique())}")
athletes.head()

# of countires: 230
# of sports: 66
# of events: 765
# of athletes: 134732

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [57]:
extrema_by_sport = pd.DataFrame(index=athletes['Sport'].unique())
extrema_by_sport.sort_index(inplace=True)
columns_of_interest = ['Height', 'Weight','Age']
aggregations = ['min', 'max']
for column in columns_of_interest:
    no_nans = athletes.dropna(subset=column)
    for aggregation in aggregations:
        new_column_name = column + '_' + aggregation
        extrema_by_sport[new_column_name] = no_nans.groupby(['Sport']).agg({column:aggregation})

In [66]:
extrema_by_sport.head()

,Height_min,Height_max,Weight_min,Weight_max,Age_min,Age_max
Aeronautics,NaN,NaN,NaN,NaN,26.0,26.0
Alpine Skiing,142.0,200.0,45.0,107.0,14.0,55.0
Alpinism,NaN,NaN,NaN,NaN,22.0,57.0
Archery,152.0,197.0,42.0,130.0,14.0,71.0
Art Competitions,150.0,190.0,59.0,93.0,14.0,97.0

In [65]:
no_nans = extrema_by_sport.dropna(subset='Height_max')
tallest_athlete = athletes[athletes['Height'] == max(no_nans['Height_max'])]
tallest_athlete

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
265040,132627,Yao Ming,M,20.0,226.0,141.0,China,CHN,2000 Summer,2000,Summer,Sydney,Basketball,Basketball Men's Basketball,NaN
265041,132627,Yao Ming,M,23.0,226.0,141.0,China,CHN,2004 Summer,2004,Summer,Athina,Basketball,Basketball Men's Basketball,NaN
265042,132627,Yao Ming,M,27.0,226.0,141.0,China,CHN,2008 Summer,2008,Summer,Beijing,Basketball,Basketball Men's Basketball,NaN